Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.SetAnalyticalProjectionDatumPlane(Autodesk.Revit.DB.ElementId)
Sets the Analytical Projection to supplied Datum Plane.
datumPlaneId:
Identifies Datum Plane ElementId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
datumPlaneId is not valid for this Sketch Component.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.IsValidDatumPlaneForProjection(Autodesk.Revit.DB.ElementId)
Indicates whether Datum Plane is valid Analytical Projection of Sketch Component.
datumPlaneId:
ElementId identifying Datum Plane.
Returns:
True if Datum Plane is valid; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011